[
  "С наступающим Новым Кодом!",
  "Запилил мега-функцию. Оказалось, велосипед.",
  "Включил музыку. +10 к правильности кода.",
  "\"Это не наш метод,\" — сказал один класс другому.",
  "Не везёт в любви, повезёт в С++.",
  "Знакомая попросила переустановить windows. Взял дистрибутив ubuntu.",
  "Как я стал программистом? Мне лень было учиться на другую профессию.",
  "Я не хочу печенек и кофе! Я хочу работать.",
  "Судя по количеству обновлений Firefox и Flashplayer, их пишет Дарья Донцова.",
  "Смотрю сериалы про ЦРУ, чтобы поржать с их \"хакеров\".",
  "People always ask me why my keyboard is so loud. Don't they know that C++ is strongly typed.",
  "Один терапевт — это 1024 гигапевта, или 1048576 мегапевтов.",
  "Я работаю, когда отдыхаю. И отдыхаю, когда работаю.",
  "Не компилируй мне мозги!",
  "Я верю в компиляцию с первого раза.",
  "Работать в главном потоке – это мейнстрим.",
  "Решил для себя написать программку для быстрого определения своего IP. Ищу ошибку в тысячной строке.",
  "Решил походить по собеседованиям. Понял, насколько мало я знаю.",
  "Чудеса случаются. Это я вам как программист говорю.",
  "Сметана — это драйвер для борща.",
  "Тестирование. Время разочарований.",
  "Ну что непонятного? Я же русским языком сказал: баг пофиксил, проапдейтил продакшен.",
  "Программиста отличает способность найти выход из сложной ситуации. Так же, поражает умение найти туда вход...",
  "Пока придумывал имя переменной, забыл, для чего она мне нужна.",
  "В универе ходил только на программирование.",
  "Программисты по натуре люди ленивые. Поэтому они собираются в стаи и ленятся сообща.",
  "Искал идеальную девушку, написал ее сам.",
  "Решил покодить, пока греется суп? Плохая идея!",
  "На вопрос \"Что делаешь?\", шлю скрин диспетчера задач.",
  "Челябинские программисты настолько суровы, что кодят на печатной машинке.",
  "Второе правило программиста: троллить простых смертных, которые задают глупые вопросы.",
  "Я просто хотел написать игру. И тут понеслась.",
  "Life's too short to remove USB safely.",
  "Пишешь код во сне? Значит скоро сдача проекта!",
  "Что ещё может будоражить кровь так, как кодинг до четырёх утра.",
  "Мои дети постоянно ссорятся. Конфликт версий.",
  "Программирование — это игра слов.",
  "Болтовня ничего не стоит. Покажите мне код.",
  "Проспал дедлайн. Зато выспался.",
  "Самое большое заблуждение: \"Встану-ка я завтра пораньше и всё доделаю\".",
  "Нет повести печальнее на свете, чем повесть об упавшем интернете.",
  "Когда я устраивался на работу, мне сказали, чтобы я забыл всё, чему учился в универе. Ну я и забыл.",
  "Идеального кода не существует, так как нет предела совершенству!",
  "Терпенье и true все перед root.",
  "— Сейчас, у меня друг программист. — Алло, Саш? Тут у моей подруги фен сломался...",
  "Увидел чей-то код. Раскритиковал.",
  "Задачу поставили другому программисту... Это элементарно!",
  "Ничто так не ограничивает полет мысли, как компилятор.",
  "Задал вопрос на российском форуме. Объяснили, какой я идиот.",
  "Не ложусь спать, пока не закончу. Потому что завтра уже ничего в коде не пойму.",
  "Программисты на работе общаются двумя фразами: \"непонятно\" и \"вроде работает\".",
  "Не уверен, что стоит заниматься просьбой босса. Лучше исправлю прогу.",
  "Сделал неправильно. Скажу, что так и задумано.",
  "Ничего не делал 10 секунд. Нажал Ctrl-s.",
  "Сколько раз себе говорил: \"пришел домой — сначала покушай и только потом за комп\".",
  "В високосном байте — девять бит.",
  "Не нашел диск с драйверами — написал сам.",
  "Сделал две ошибки — получил нужный результат. Исправил одну — результат неверный.",
  "Решил поработать. Но вдруг Хабрахабр сам открылся.",
  "На математике решали номер 1024. Друзья не поняли, почему он юбилейный.",
  "Чтобы разобраться в чужом коде, нужен тот, кто его писал и паяльник.",
  "Что может быть красивее заката? \"Successful build\" на экране монитора.",
  "Скинь свой исходник. Мне просто сравнить...",
  "Конечно, дорогая, ты для меня дороже компьютера.",
  "Поставил убунту. Теперь говорю всем, что не разбираюсь в винде.",
  "Покажи свой код, и я скажу кто ты.",
  "14 февраля - день компьютерщика, а не Святого Валентина.",
  "Свой код — потёмки. Чужой — лес непроходимый.",
  "Программист вообще в курсе, что он математик?",
  "Перенес рабочую функцию в новый проект. Не работает.",
  "Чак Норрис не получает ошибки компилятора. Компилятор сам подстраивается под Чака.",
  "Не говори \"гоп\", пока не скомпилируешь.",
  "Самая большая ложь 21 века: я прочел и принимаю условия пользовательского соглашения.",
  "Ошибка при определенном тесте? Решил проблему if-ом.",
  "Сломался пробел? Не беда. Alt+32.",
  "Температура в комнате, какая бы она ни была — всегда комнатная.",
  "Ночь, улица, фонарь, аптека... Звучит как постепенная загрузка текстур.",
  "Нашел непонятный код в работающей программе. Закомментил.",
  "Защищаю курсовую. Старательно обхожу баги.",
  "Чтобы отыскать баг, ты должен мыслить как баг.",
  "Я видел прекрасный мир, где программы компилируются с первого раза.",
  "Сын спросил: почему солнце восходит и заходит? Главное, что работает.",
  "99% ошибок компьютера сидят в полуметре от монитора.",
  "Я тоже мог бы рассказать тебе о сервере, но ты об этом лучше логи посмотри.",
  "Салат Фибоначчи. Составлен из вчерашнего и позавчерашнего салатов.",
  "Последняя строчка, и иду спать.",
  "Медленный компьютер — это когда ты знаешь имена всех разработчиков Adobe Photoshop.",
  "5 часов фиксил баг. Исправил одну строчку.",
  "Рабочий код бесценен. Для всего остального есть MasterCard.",
  "Начал писать программу. Объявил 10 переменных. Использовал одну.",
  "Не родился, а скомпилировался.",
  "По дороге домой — пишу код в уме.",
  "Встал ночью, чтобы сходить в туалет. Просидел за компьютером до утра.",
  "Написал 2000 строк кода без ошибок с первого раза. Проснулся.",
  "Программист — это комбинация лени и логики.",
  "Я знаю 9 операционных систем. И ни одной женщины.",
  "Увидел синий экран в телевизоре. По привычке перезапустил.",
  "Бывших программистов не существует.",
  "Клавиша \"с\". Будь проклят тот, кто додумался до этого...",
  "В комнате стало холодно. Запустил while(1); в четыре потока.",
  "Я категоричен, как Boolean.",
  "Написал код на бумажке. Отладил в голове.",
  "Это странное чувство... Когда тебе не хочется кодить и тебя тянет на улицу.",
  "Не комментируй код. Будь плохим парнем.",
  "Нельзя так просто взять и уйти с работы в 6.",
  "Нет пива? Нет сисадмина!",
  "Зашел на сайт. Нажал Ctrl+U.",
  "Набрал запрос в гугле быстрее, чем он подобрал популярные варианты. Fuck yeah.",
  "Почему ты не пишешь код прямо сейчас?!",
  "Перед тем как программировать полгода подбирал язык программирования.",
  "Ушел пораньше с работы, чтобы поработать дома.",
  "Пишу новую прогу. Пока компилирую старую.",
  "Познакомился с девушкой. Попросил IP.",
  "Настает ночь. Город начинает кодить.",
  "Первое правило программиста: не дай понять компьютеру, что ты торопишься.",
  "Сказали, что завтра проверка лицензии на компах. Поставил Ubuntu.",
  "Подруга попросила починить компьютер. Починил.",
  "Пришел переустанавливать Windows. Принесли зачем-то отвертку.",
  "Только ненаписанный код не содержит ошибок.",
  "Хотел объяснить как это сделать. Сделал сам.",
  "Нужно создать видимость работы. Форматирую код вручную.",
  "Отсортировал массив. Надо написать об этом в своем \"блоге программиста\".",
  "Думай, как баг. Действуй, как баг. И ты найдёшь баг!",
  "Написал код — работает. Не нравятся имена переменных — поменял их... Код не работает!",
  "Люблю петь в душе. На ассемблере.",
  "У каждого программиста есть инстинкт автосохранения.",
  "Решил убраться на рабочем столе, создал папку и сгреб все туда.",
  "Посеял ключи от квартиры. В голове крутятся мысли о Ctrl+F.",
  "Паблик морозов. Класс-потомок, выдающий по запросу все данные класса-предка, независимо от степени их сокрытия. ",
  "У программера есть два состояния: \"втупляю\" и \"поперло\".",
  "Не нашёл нужной программы в интернете. Написал сам.",
  "Отпуск — время переустановить ОС.",
  "Я настолько ленив, что сразу пишу рабочий код.",
  "Компилятор — не прощает ошибки.",
  "Не работает часть кода? Изменил название переменных, заработало!",
  "Тот момент, когда все должно работать, НО НЕ РАБОТАЕТ.",
  "Как-то раз я скомпилировал программу с первого раза без ошибок. Но появилась надпись: \"Тебе всё равно никто не поверит\".",
  "Есть два вида вредоносных программ. 1) Вирусы. 2) Яндекс-бар.",
  "Сисадмин мнил себя Богом сети. Электрик грубо развеял этот факт.",
  "Программист — это не профессия. Программист — это образ жизни.",
  "Самое трудное в программировании — это придумывать имена переменным.",
  "Дети – это наше будущее! И роботы. Дети и роботы.",
  "Написал программу. //В комментариях еще 3.",
  "Пошел в туалет с ноутом. Вышел через три часа.",
  "Придумал гениальную идею. Загуглил, оказывается, такое уже есть...",
  "Настроил комп против людей!",
  "Я не лентяй! Я — программист.",
  "Не понравился шрифт на сайте. Взломал. Изменил. Прочитал, что хотел.",
  "Ты думал это любовь. А ей просто надо было винду переустановить.",
  "Когда мне хочется экстрима, делю на калькуляторе на ноль.",
  "Выучил английский очень быстро. Он очень похож на С++.",
  "Пока засыпал, полностью обдумал код. Проснулся – забыл.",
  "Чтобы искать в гугле, жена сперва ищет гугл в яндексе.",
  "4 часа думал, как улучшить код. Испортил за 5 минут.",
  "Если инженер — врач компьютера, то я, безусловно, психолог.",
  "Скомпилировал свою программу, появился Яндекс Бар.",
  "Есть два пути писать безошибочные программы. И только третий правильный.",
  "Попросили исправить чужой код. сtrl+A; delete; пишу программу.",
  "Израильский SQL-сервер. Отвечает запросом на запрос.",
  "Не все потеряно пока пальцы над клавой и на экране строка...",
  "Увидел на часах 10:24. Загадал желание.",
  "Убраться на столе? Не, не слышал.",
  "Хороший программист должен с легкостью программировать на всем, на чем можно. И с небольшим трудом на том, на чем, казалось бы, нельзя.",
  "Пришел на работу пораньше — провел все утро вконтакте.",
  "На С я могу просто делать ошибки. На С++ я могу их наследовать!",
  "Отсутствие фантазии — это Project1 в Новой папке.",
  "Изучаешь ассемблер? Ты пал так низко!",
  "if (x==true) & (x==false) then x=schrodinger endif",
  "Если в первый раз не вышло, назови это версией 1.0",
  "Каждый раз, когда ты пишешь long вместо byte, кто-то бежит докупать планки оперативки.",
  "9:00 — пришел на работу. 13:40 — запустил IDE.",
  "Завожу переменную \"С\". Чтобы в коде писать С++.",
  "Бойся 228, если это число ошибок в коде.",
  "— Папа, а кто-то ещё пишет на Паскале? — Нет, сын, это — фантастика.",
  "Пора дефрагментировать квартиру.",
  "Красные глаза \"по умолчанию\".",
  "Работай! Ну пожалуйста...",
  "Тоскую по тем временам, когда к ЭВМ допускали людей только с прямыми руками.",
  "Посмотрел фильм \"Социальная сеть\". Вдохновленно сел писать код.",
  "Дописал комментарий к коду - откомпилировал заново.",
  "Солнце село, свет погас. Время кодинга сейчас!",
  "Написал строчку, запустил, не работает. Стер. Написал то же самое.",
  "Долгое время считалось, что бит неделим. Но советские ученые...",
  "Взломал БД сайта, чтобы вспомнить свой пароль.",
  "Вы пробовали выключить и снова включить?",
  "Женская логика — это генератор случайных чисел.",
  "Слушаю музыку с кейгенов.",
  "Гонял прогу по тестам. Пытался найти хоть один работающий.",
  "Пытаешься понять, почему код не работает. На следующий день запускаешь — работает. Как?!",
  "Переустановил ей Windows. Даже спасибо не дала.",
  "— Ты чего не спишь? — Закодировался.",
  "Кодим! До потери сознания!",
  "Друг рассказал, что микроволновка сломалась. Спросил, что пишет в логах.",
  "Увидел в тетради дочери надпись \"Леша+Маша=Дружба\". Не выдержал, исправил на \"Дружба==Леша+Маша\".",
  "Не воспринимаю всерьёз людей, моложе Windows 98.",
  "Интересно, что бы Шерлок Холмс мог сказать о моем коде?",
  "Написал код. Пересмотрел его еще раз, чтобы понять, насколько я охуенен.",
  "Что такое индустриальное программирование? Сидят индусы и пишут триальные программы!",
  "Переустановка Windows — как разморозка холодильника. Помогает, но ненадолго.",
  "Кто рано встает, у того скоро дедлайн проекта.",
  "Зевнул перед зеркалом. Вызвал рекурсию.",
  "Не откладывай на завтра, если завтра сдача проекта. Хотя...",
  "Если нацарапать гвоздиком что-нибудь на дискете, то прочесть с нее можно только то, что вы на ней нацарапали.",
  "О, ты программист? Глянешь компьютер? ... Будто я никогда не видел компьютеров.",
  "Я сам раозбарл, поичтсил и сбоарл клаиуавтру.",
  "Я ненавижу всё, что не работает. А то что работает, я пытаюсь улучшить и начинаю ненавидеть.",
  "Жена сказала, что мы мало общаемся. Купил ей компьютер и соединил с моим.",
  "Java-программисты после бурного корпоратива не убирают за собой.",
  "Ну вот допустим, у тебя есть $1000. Давай для определенности округлим до $1024...",
  "Девушка, как винда. Загрузишь — зависнет.",
  "Красивый загар, где отдыхал? Отдыхал? Это от монитора.",
  "Сколько пальцев на руке? 0, 1, 2, 3, 4... 4!",
  "Сломался комп. Ем на кухне.",
  "Не нашел ошибку в своем коде за час. Ошибка компилятора!",
  "Причина багов — преждевременная компиляция.",
  "Семь бед — один reset.",
  "First words in my life? \"Hello, world!\"",
  "Код Шредингера — это такой код, не запуская которого, нельзя сказать, есть ли он, или его надо весь удалить и написать новый.",
  "Попросили установить \"какой-нибудь антивирус\". Поставил Linux!",
  "Написал прогу. Не работает. Все стер, написал заново. Заработало.",
  "3k строчек кода. Баг, ну ты моргни хотя бы.",
  "Стакан наполовину пуст или наполовину полон? Я бы сказал, что он в 2 раза больше, чем нужно.",
  "Из-за леса, из-за гор, к нам пришел Fatal Error.",
  "Завел кошку, еще не придумал, как назвать. Пока обращаюсь к ней по айпишнику.",
  "У меня пальцы пианиста. И мозг математика.",
  "Когда получаю новый проект, думаю не о процессе написания, а о сладком моменте финала!",
  "Заработался. Перепутал 3 этаж с 11.",
  "Этот волнительный момент, когда код написан правильно, но ничего не работает!",
  "Первыми словами моего сына будет: \"Hello, world!\"",
  "Грелся в ванной, нашёл ошибку в коде по памяти.",
  "Функция \"свободная касса\" превращает половину очереди в стек.",
  "Непонимание как работает код, не освобождает вас от последствий его работы.",
  "#define private public. Показать все, что скрыто.",
  "Если двух программистов посадить за один компьютер, будет много шума.",
  "Не пью, не курю, на ноль не делю.",
  "Нажимаю \"Выборочная установка\". Далее, далее, далее.",
  "Хотите разозлить программиста? Попросите у него, чтобы он научил вас делать игры.",
  "Sudo. Почувствуй себя всемогущим.",
  "Люди делятся на два типа – первый – те, кто нумерует массивы с единицы и первый – те, кто нумеруют с нуля.",
  "Админу стало скучно. Позвонил в тех. поддержку, сказал, что сломался интернет.",
  "Программист не знает усталости!",
  "Успешная компиляция поднимает настроение.",
  "Python — это как Energizer, работает до 10 раз дольше.",
  "Самый сложный язык программирования — это первый.",
  "Стер комментарии, поменял форматирование. Как будто бы сам написал.",
  "Первый этап разработки программы — борьба с ленью.",
  "Меня трудно найти, легко потерять и невозможно забыть. Да я же рабочий исходник!",
  "Пришел на свидание к девушке. Подарил букет из оптоволокна.",
  "Попался случай, где без goto действительно не обойтись. Дьявол в бешенстве.",
  "Любимый вид танца: с бубном.",
  "Код работает с первого раза? Ищите ошибку в компиляторе.",
  "Решаем проблемы неизвестные никому способами, которые никто не знает.",
  "Компилятор нашел ошибку. Закомментировал строку.",
  "Пришел в гости. Научил кота выключать комп.",
  "Вы что, читать не умеете?! Тут же #000000 по #FFFFFF написано.",
  "Хороший программист характеризуется умением доказать, почему задачу невозможно выполнить, когда ему просто лень её выполнять.",
  "— А зачем ты сохраняешься в ворде перед печатью? — Привычка.",
  "Давайте утром встретимся... В 14.00 вас устроит?",
  "Когда мне хочется немного извращений, я начинаю делать вставки на ассемблере.",
  "Программист — самый трудолюбивый работник в фирме! До обеда и пашню засеял, и город построил, и воинов нанял!",
  "При компиляции держу пальцы крестиком.",
  "Неправильно указал тип переменной. 2 + 2 = 22",
  "Начинающий программист уверен, что в 1 килобайте 1000 байт. Законченный программист уверен, что в 1 километре 1024 метра.",
  "Те-ле-ви-зор?.. Не, не слышал.",
  "В аду уже уготовано место для тех, кто путает программистов с сисадминами.",
  "No Windows. No problems.",
  "Завтра дедлайн. Хороший повод начать делать проект.",
  "Как ты смог это реализовать? — Мне приснилось.",
  "Чтобы компенсировать растущую мощность компьютеров, программисты используют фреймворки.",
  "Сижу, работаю, чувствую запах жареной картошки... А ведь я ее варить ставил.",
  "Чайник показал код и спросил, где у него ошибка. Ответил, что в ДНК.",
  "Я не страдаю бессонницей. Я ей владею.",
  "Работать надо не 12 часов, а головой.",
  "Мне кажется, начальник на меня смотрит и думает: \"Это устройство может работать быстрее\".",
  "Лень кодить нудную фичу. Убедил заказчика, что она не нужна.",
  "Сел кодить. Сделал билд. Ошибок нет. Странно.",
  "Хороший программист проливает кофе на себя. И ноут цел, и бодрит в два раза лучше.",
  "Исправлял один баг. Создал другой.",
  "Работает? Не ожидал.",
  "Программист мудреет, когда понимает разницу между \"запустить программу\" и \"получить запускающуюся программу\".",
  "Накодил? Убери за собой!",
  "Написал интуитивно код. Запустил. Работает. Теперь сижу, разбираюсь, как именно работает.",
  "Жизнь — игра. Сюжет — так себе, но графика потрясающая.",
  "Дебажил 6 часов. Понял, что баг в компиляторе.",
  "Хакер — человек способный наступить на грабли, даже если они спрятаны в сарай и заперты на замок. ",
  "Глянул чужой код... Да лучше я напишу свой с нуля!",
  "Скоро останется два типа людей. Те, кто управляет компьютерами, и те кем управляют компьютеры.",
  "Неделю назад закодировался. Вчера подобрал код.",
  "Купил айфон и кило яблок. Пытаюсь их также откусить.",
  "При попытке поработать был обнаружен интернет.",
  "Программирование как секс. Ошибешься — и нужно поддерживать всю жизнь.",
  "Переустановил соседу винду. Теперь скрываюсь от других соседей.",
  "Звоню в поддержку. Говорю, что делать.",
  "Приснился кошмар. Microsoft Linux XP.",
  "Поступил на программиста. 2 года думал, что учусь на профессора математики.",
  "Поставили на электростанцию Android. Через день — разрядилась.",
  "Никого работа программы не удивляет так часто, как ее создателя.",
  "Рано или поздно люди взрослеют и переходят на Linux.",
  "Закрыл диспетчер задач через диспетчер задач.",
  "Думать или загуглить — вот в чем вопрос.",
  "Пошел в магазин. Купил ящик кофе и печенек.",
  "Шум от кулера, как колыбельная.",
  "В магазине попросили передать пакет. Спросил IP адрес.",
  "Рассказал другу шутку. Полчаса объяснял термины.",
  "Сказал, что занимаюсь версткой. Подарили рубанок!",
  "Сколько программистов нужно, чтобы закрутить лампочку? Ни одного. Это аппаратная проблема. ",
  "Программирование — процесс творческий. А вдохновение приходит поздно вечером.",
  "Люди делятся на два типа: iostream и stdio.",
  "Минздрав предупреждает: программирование является причиной развития интеллекта и креативности мышления.",
  "Я бы изменил мир, но Бог не дает исходников.",
  "0 программистов ругал сердитый шеф. Потом уволил одного, и стало их FF.",
  "Тех. поддержка. Семь бед — один ответ.",
  "Этот момент, когда на форуме написал название функции наполовину и ждёшь, когда IDE допишет её.",
  "Кому и командная строка дружественный интерфейс...",
  "Нормализовал базу, правильно применил паттерны, придумал быстрый алгоритм, оптимизировал его код... Эх, мечты, мечты.",
  "Среда разработки. Четверг отладки.",
  "Надоел вид за окном. Поменяю обои на рабочем столе.",
  "Если хочешь что-то сделать, сделай это сам.",
  "Переустановил винду за спасибо.",
  "Real programmers don't document if it was hard to write, it should be hard to read.",
  "Все работает. Переключил с debug на release. Твою же мать...",
  "Пустая кружка — единственное, что должно отрывать тебя от кодинга.",
  "И настал дедлайн, и живые позавидовали мертвым.",
  "Почистил дорожку от снега. Повысил пропускную способность.",
  "Увидел свой код полугодовой давности. Чуть не помер со стыда.",
  "Пришел в гости — почини компьютер.",
  "В гардеробе выдали номерок 404. Стремно за куртку.",
  "Мышечная память — это когда страница еще не загрузилась, а ты уже поставил мышку на то место, куда надо кликнуть.",
  "Программист — это профессиональный конвертёр галлюцинаций заказчика в жёсткую формальную систему.",
  "Сломал кнопку правого шрифта. Понял значение цитаты: \"Люди начинают ценить только тогда, когда теряют\".",
  "Дописал строку. Нажал Ctrl+S.",
  "Завтра. Как же много в слове этом таится дней и ночей.",
  "Люди, как пиратская версия винды. Вроде ось одна, а баги у всех разные.",
  "Добавил несколько комментов. Лучше перекомпилю...",
  "Закупился валерьянкой — пишу новую программку.",
  "Как папку не назови, искать всё равно придется.",
  "Идеальный интерфейс — это когда мама понимает.",
  "Любимая каша — Perl'овая.",
  "Написал \"Hello, world\". Напишу и Windows 9.",
  "Написал сотни хороших программ. В голове.",
  "У программиста было 2 сына: Антон и Неантон.",
  "Открываю IDE с исходным кодом, чтобы другие люди боялись трогать компьютер.",
  "В Гарри Поттере в газетах печатают гифки.",
  "Нашим детям будет сложно. Все логины будут заняты.",
  "Кто-то ищет вторую половинку. Я ищу ошибку в коде.",
  "В моей квартире не бардак, а POINT-AND-CLICK ADVENTURE.",
  "Запели птички. Пора ложиться спать.",
  "Код работает с первого раза. Что-то не так...",
  "Что объединяет программиста и наркомана? Красные глаза.",
  "Программист — это не тот, кто пишет программы, а тот, чьи программы работают.",
  "Исправил в коде одну ошибку. Создал две новых.",
  "Программист, ты стал совсем взрослым. У тебя уже растут руки.",
  "Я не хочу ничего решать! Я хочу ТЗ.",
  "Сказали, что человек имеет свойство разговаривать. Объяснил, что это метод.",
  "Программист говоришь? Контакт взломать сможешь?",
  "У меня нет решения. Но я восхищен красотой проблемы.",
  "Бывают моменты, когда единственное, что ты хочешь - это делить на ноль.",
  "Закончил проект! Заказчик сменил ТЗ...",
  "Любимые хэш-тэги программистов: #include и #define.",
  "Все работает. Оптимизировал. Не работает.",
  "У всех свои тараканы в голове, но у разработчиков они превращаются в программные баги.",
  "От меня боятся принимать .exe файлы.",
  "Вероятность успешной компиляции с первого раза крайне мала.",
  "Ничто так не возбуждает дам, как разработка компьютерных программ.",
  "К Н Ш М Ы. Доктор, у вас неправильная кодировка.",
  "Кроме женщин и компьютеров, я люблю девушек и калькуляторы.",
  "Захотел поиграть в тетрис. Написал его.",
  "А вы знали, что блок схемы нужны, чтобы писать по ним код, а не наоборот?!",
  "Дали проект. Глаза делают, руки не хотят.",
  "Судя по отступам, Маяковский писал на Python.",
  "Телевизор?.. А он ещё существует???",
  "А+=++А+++++А++; Java-программисты смеются над вами.",
  "Чем больше весит ненужный файл, тем лучше.",
  "Собрал ядро Линукс. Руки переползли на плечи.",
  "Готовлю еду по алгоритму.",
  "Есть две вещи, которым программист учится всю жизнь. Читать и писать.",
  "Занимаюсь сексом — в безопасном режиме.",
  "А еще, чтобы от нас отстали, мы говорим обычно так: наши инженеры работают над решением вашей проблемы.",
  "Уволился с работы. Наконец-то можно покодить от души.",
  "Настоящий программист — всегда голодный, потому что он забывает поесть.",
  "И я там был, wi-fi ловил. Сети находило, а доступа не давало.",
  "Я верю только в три вещи: инкапсуляцию, полиморфизм и наследование.",
  "Сяду в умную позу и нахмурю брови. Босс решит, что я думаю над проблемой.",
  "Патриотичный цикл for(int c=0; c<10; c++)",
  "Спросил на форуме, что не так с кодом. Узнал много нового о себе.",
  "У всех компиляторы как компиляторы, а мой — истеричка.",
  "Выучил английский, чтобы не менять раскладку.",
  "Начал решать проблему с помощью регулярных выражений. Теперь решаю две проблемы.",
  "Все мы расплачиваемся за первородный грех. Изучение Basic в особо впечатлительном возрасте.",
  "Два часа искал ошибку в коде и вдруг! случайно нашёл её! Что? И всё из-за этой хрени?",
  "Не смог выиграть в логическую игру. Написал программу.",
  "Расписываю ручку: \"Hello, world\".",
  "Ночью спать? Не, не пробовал...",
  "Дорогой, сходи, купи пакет молока и если будут яйца, купи 6. Купил 6 пакетов молока, яйца были.",
  "Да кто такой криворукий код писал?! Ааа, это же я, год назад...",
  "Я не помню, почему написал это таким кривым образом, но на это точно была причина.",
  "Кто сдал проект, тот в цирке не смеётся.",
  "Знакомые гуманитарии узнали, что я программист. Достали шутками про 0 и 1.",
  "Удобный интерфейс? Главное, что работает.",
  "Никто не называет автомобиль двигателем, но вот системный блок процессором...",
  "Настоящие программисты не боятся использовать goto.",
  "Очередь в магазине. Ну почему ты не стек?!",
  "Программисты не рождаются. Программисты наследуются.",
  "Будь первым. Пиши вирусы для Linux.",
  "Приснился идеальный код. Проснулся и записал.",
  "Код - это поэзия.",
  "Вот черт, я потерялся! В коде.",
  "Два телепата начали читать мысли друг друга одновременно... Умерли от переполнения стека.",
  "Отлаженный код - хороший код.",
  "На клавиатуре Чака Норриса только клавиши 0 и 1.",
  "Написал вирус, чтобы протестировать антивирус.",
  "На ассемблере можно написать всё что угодно. Но жизнь коротка.",
  "Захотел что-то поменять в жизни - переустановил винду.",
  "Разгруппировал файлы в папке \"мусор\" по типу файлов. Стало почище.",
  "Если мужчина согласился переустановить вам Windows, значит, вы ему действительно нравитесь.",
  "Учил детей читать. Побитово.",
  "Люди делятся на два типа \"shift+alt\" и \"ctrl+shift\".",
  "Коктейль \"Рекурсивный\": 20% спирта, 30% воды, 50% коктейля \"Рекурсивный\".",
  "Лег спать в 10 вечера! А вам слабо?",
  "Девушка сказала 100000 раз написать \"Прости\". for i:=1 to 100000 do writeln('Прости').",
  "Нечем заняться... Переустановлю ОС!",
  "Идти спать?! — Да ну, лучше еще покодить... И так постоянно.",
  "На клаве стерлись буквы C и V. Палево.",
  "Написал прогу — не работает. Написал систему под эту прогу — все отлично.",
  "Удалил корзину в корзину.",
  "Сынок, хватит сидеть за компьютером. Я программирую, мам!",
  "Подруга написала: \"Привет)\". Ответил, что она забыла одну скобку.",
  "Каждый программист в своей жизни обязан написать калькулятор.",
  "Попросили написать программу на Basic. Написал и скинул на перфокарту.",
  "Windows для чайников. Это не книга — это утверждение.",
  "Искал диск с виндой. Нашел паспорт, зачетку, читательский билет, деньги, еду.",
  "На Рython можно написать все. На C++ можно написать Python.",
  "\"Плохая\" переменная отдаётся всем функциям подряд и разрешает делать с собой всё, что угодно.",
  "В моих программах нет багов. Есть лишь неожиданные фичи.",
  "Сейчас придет девушка в гости. Убрался на рабочем столе.",
  "Не поставил запятую — положил сервак.",
  "У меня есть girlfriend. Сам написал на С++.",
  "Сделал в жизни ошибку. Хотел исправить. Error opening file 'life.exe' for writing.",
  "Чихнул в перечницу — вызвал рекурсию.",
  "Чтобы запомнить телефон, я вычисляю контрольную сумму.",
  "Нельзя просто так взять и скомпилировать чужие исходники с первого раза.",
  "Первое правило уборки в квартире: убрать себя от компьютера.",
  "День рождения AGE++;",
  "Битва IT-экстрасенсов. Лучшие админы проникают в головы юзеров и угадывают, что они нажали и почему \"ничего не работает\".",
  "На вопрос: \"Можно ли это сделать?\" — Отвечаю да. А потом думаю как.",
  "— О, ты же шаришь в компах... — Нет, только не это!",
  "Сломался ноут перед отъездом. Дорога в никуда.",
  "Я твоя программа и я не хочу создавать файл, я хочу права администратора.",
  "Чем программист отличается от Бога: Бог не считает себя программистом.",
  "Высыпаюсь, пока включается компьютер.",
  "Не ошибается тот, кто ничего не кодит.",
  "Проснулся. Оказалось, не спал.",
  "Пришел к девушке с цветами и шампанским — отказала. Стандартные драйверы не подошли.",
  "9 утра. — Уже работаешь? ... — Ещё работаю.",
  "Лучшая защита от SQL инъекций — отсутствие базы данных.",
  "Я залогинился взглянуть, не залогинилась ль она, чтоб посмотреть, не залогинился ли я.",
  "Перепутал Рождество с Хэллоуином. oct(31) = dec(25).",
  "Видели ночь, кодили всю ночь до утра!",
  "Вся жизнь — программа. А люди в ней локальные переменные.",
  "Красный свет на светофоре - это точка останова.",
  "Во тьме ночной, при свете дня — ищу ошибку в коде я.",
  "Хуже всего приходится программистам Microsoft. Им, в случае чего, и обругать-то некого.",
  "Компилятор, не матерись! Объясни НОРМАЛЬНО.",
  "Все мы ходим по лезвию бритвы. Кто-то нюхает кокаин, кто-то убивает людей. Я же, небезопасно извлекаю флешки.",
  "Звоню в поддержку провайдера — послушать музыку.",
  "Мы писали, мы писали, наши пальчики устали. Мы немного отдохнем и опять писать начнем!",
  "Лень решать задачу по математике. Написал программу, которая ее решает.",
  "Романтический ужин при свичах в компании соблазнительных цисок.",
  "Как хорошо бы ты ни программировал, всё равно попросят переустановить Windows.",
  "Выучил английский язык, придумывая имена переменных и функций.",
  "Не обдумывай код. Будь спонтанным.",
  "На чем пишешь — звучит так же, как: где служил?",
  "Чужой код. 2500 строк. Нет комментариев. Непонятные переменные и функции. Ошибки с памятью... Вызов принят!",
  "В аду есть отдельный котёл для тех, кто называет системный блок процессором.",
  "Компилировал, перекомпилировал да не выперекомпилировал.",
  "137 сообщений об ошибках. Забыл точку с запятой.",
  "Дописал свою баговую прогу, все продебажил, работает идеально...но тут — проснулся.",
  "Все мы ходим по лезвию бритвы. Кто-то нюхает кокаин, кто-то убивает людей. Я же, не обнуляю переменные.",
  "Когда-нибудь мой сын покажет на иконку сохранения и спросит, почему она так выглядит. Что я ему скажу?",
  "int i = 5; i = ++i + ++i; Да я точно тебе говорю, 14."
]